# На вход программе подается строка с названиями городов,
# записанных в одну строчку через пробел.
# Необходимо ее прочитать и применить функцию map так,
# чтобы она возвращала названия городов только длиной
# более 5 символов. Вместо остальных названий - строку
# с дефисом ("-").

# Пример:
# Москва Уфа Вологда Тула Владивосток Хабаровск
# Результат:
# Москва - Вологда - Владивосток Хабаровск

# P.S. Очевидно, функцию для передачи в map нужно сделать самому.

a = (input('Введите список городов через пробел ').split())
print(a)

def my_map(func: callable, a):
    new_list = []
    for i in a:
        if func(i):
            new_list.append(i)
    return new_list

def lst(total_goroda):
    return len(total_goroda) > 5

result = my_map(lst, a)
print('-'.join(result))

